import Vue from 'vue';
import Vuex from 'vuex';

Vue.use(Vuex);

export default new Vuex.Store({
    state:{
        scripts:[
            "公共线索1",
            "公共线索2",
            "公共线索3",
            "公共线索4",
            "公共线索5",
            "公共线索6",
            "公共线索7",
            "公共线索8",
            "公共线索9",
            "公共线索10",
            "公共线索11",
            "公共线索12",
            "公共线索13",
            "公共线索14",
            "公共线索15",
            "公共线索16",
            "公共线索17",
            "公共线索18",
            "公共线索19",
            "公共线索20",
            "个人线索1",
            "个人线索2",
            "个人线索3",
            "个人线索4",
            "个人线索5",
            "个人线索6",
            "个人线索7",
            "个人线索8",
            "个人线索9",
            "个人线索10",
            "个人线索11",
            "个人线索12",
            "个人线索13",
            "个人线索14",
            "个人线索15",
            "个人线索16",
            "个人线索17",
            "个人线索18",
            "个人线索19",
            "个人线索20",
            

            /*
            //湖边使用聆听成功
            "你听到了湖水中......",
            //湖边使用聆听失败
            "你并没有察觉到湖水里......",
            //湖边使用侦察成功
            "你发现远处...",
            //湖边使用侦察失败
            "你的视线因为...",
            //甲板上使用聆听成功
            "你听到甲板下方传来...",
            //甲板上使用聆听失败
            "你附近有人大声说话以至于...",
            //甲板上使用说服成功
            "你的口才成功说服了...",
            //甲板上使用说服失败
            "对方并不相信你的承诺...",
            //甲板上使用人类学成功
            "你通过分析认定他说谎了...",
            //甲板上使用人类学失败
            "你无法从对方的脸上读出什么...",
            */
        ]
            
    }
})